src/cf/Documents/CRM_Интерес.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>CRM_Интерес</Name>
			<Comment>Интерес</Comment>
			<BasedOn>
				<xr:Item>Document.CRM_Интерес</xr:Item>
				<xr:Item>Catalog.Партнеры</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВероятностьСделки</Name>
					<Comment>Вероятность сделки в процентах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующегоДействия</Name>
					<Comment>Дата следующего действия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеМероприятия</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_Интерес</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_РассылкаЭлектронныхПисем</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_Телемаркетинг</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.CRM_БизнесПроцесс</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьCRM_Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.КоммерческоеПредложениеКлиенту</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьCRM_Событие</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_СообщениеМессенджера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Контактное лицо</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяВыручка</Name>
					<Comment>Ожидаемая выручка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Comment>Офис подразделения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ОфисыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Comment>Партнер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение ответственного</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотенциальныйКлиент</Name>
					<Comment>Потенциальный клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКлиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Comment>Причина отказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныОтказаПоИнтересам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУслуги</Name>
					<Comment>Тип услуги</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеИнтереса</Name>
					<Comment>Состояние интереса</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СостоянияИнтересов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Comment>Тема документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующееДействиеПредставление</Name>
					<Comment>Служебный</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Избранный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>CRM_Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/CRM_Интерес/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПодборИзТелемаркетинга") Тогда
		
		Для Каждого ТекущийОтбор Из Список.Отбор.Элементы Цикл
			Если ТекущийОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ответственный") Тогда
				ТекущийОтбор.Использование	= Ложь;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		Для Каждого ТекущийОтбор Из Список.Отбор.Элементы Цикл
			Если ТекущийОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СостояниеИнтереса") Тогда
				ТекущийОтбор.Использование	= Ложь;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		Если Параметры.Свойство("Партнер") И ЗначениеЗаполнено(Параметры.Партнер) Тогда
			ОтборНайден = Ложь;
			Для Каждого ТекущийОтбор Из Список.Отбор.Элементы Цикл
				Если ТекущийОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партнер") Тогда
					ТекущийОтбор.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
					ТекущийОтбор.ПравоеЗначение	= Параметры.Партнер;
					ТекущийОтбор.Использование	= Истина;
					ОтборНайден = Истина;
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
			Если НЕ ОтборНайден Тогда
				ЭлементОтбора					= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Партнер");
				ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение	= Параметры.Партнер;
				ЭлементОтбора.Использование		= Истина;
				ЭлементОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
			КонецЕсли;	
		Иначе
			Для Каждого ТекущийОтбор Из Список.Отбор.Элементы Цикл
				Если ТекущийОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партнер") Тогда
					ТекущийОтбор.Использование	= Ложь;
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
		Если Параметры.Свойство("КонтактноеЛицо") И ЗначениеЗаполнено(Параметры.КонтактноеЛицо) Тогда
			ОтборНайден = Ложь;
			Для Каждого ТекущийОтбор Из Список.Отбор.Элементы Цикл
				Если ТекущийОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КонтактноеЛицо") Тогда
					ТекущийОтбор.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
					ТекущийОтбор.ПравоеЗначение	= Параметры.КонтактноеЛицо;
					ТекущийОтбор.Использование	= Истина;
					ОтборНайден = Истина;
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
			Если НЕ ОтборНайден Тогда
				ЭлементОтбора					= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("КонтактноеЛицо");
				ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.Использование		= Истина;
				ЭлементОтбора.ПравоеЗначение	= Параметры.КонтактноеЛицо;
				ЭлементОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
			КонецЕсли;	
		Иначе
			Для Каждого ТекущийОтбор Из Список.Отбор.Элементы Цикл
				Если ТекущийОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КонтактноеЛицо") Тогда
					ТекущийОтбор.Использование	= Ложь;
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
